# 9. Data Cleansing

In [1]:
import pandas as pd
import numpy as np
import random

In [2]:
PATH_DATA = '../mydata/employee_data/'

## Get data

In [4]:
df_unclean = pd.read_csv(PATH_DATA+'unclean_data.csv')
df_unclean.head()

    x_id    date_day  x_value
0  134.0  2016-12-23     3.00
1  217.0  2017-02-20     2.00
2  173.0  2016-11-18     2.40
3   65.0  2016-04-21     3.00
4  102.0  2016-12-07     2.75

In [5]:
df_unclean0 = df_unclean.copy()

# Calculate and Filter missing data

In [6]:
df_unclean.shape

(140000, 3)

In [7]:
## null count
df_unclean.isnull().sum()

x_id         356
date_day     100
x_value     9398
dtype: int64

In [9]:
(df_unclean.isnull().sum()/140000)*100

x_id        0.254286
date_day    0.071429
x_value     6.712857
dtype: float64

In [10]:
## not null count
df_unclean.count()

x_id        139644
date_day    139900
x_value     130602
dtype: int64

In [11]:
## get null x_id
df_unclean[df_unclean['x_id'].isnull()]

        x_id    date_day  x_value
260      NaN  2016-08-11      4.0
1283     NaN  2016-09-10      2.0
1379     NaN  2016-05-06      3.5
1491     NaN  2016-12-22      4.0
2204     NaN  2017-02-22      2.0
...      ...         ...      ...
138601   NaN  2016-07-31      4.0
138667   NaN  2016-09-23      3.0
139220   NaN  2016-09-12      4.0
139407   NaN  2016-10-30      4.0
139489   NaN  2016-07-06      1.0

[356 rows x 3 columns]

In [12]:
## get non-null x_id
df_unclean[~(df_unclean['x_id'].isnull())]

         x_id    date_day  x_value
0       134.0  2016-12-23     3.00
1       217.0  2017-02-20     2.00
2       173.0  2016-11-18     2.40
3        65.0  2016-04-21     3.00
4       102.0  2016-12-07     2.75
...       ...         ...      ...
139995   43.0  2016-10-17     3.00
139996  663.0  2016-10-07     2.00
139997  143.0  2015-06-07     1.00
139998  130.0  2016-07-18     3.00
139999  137.0  2016-06-17     2.00

[139644 rows x 3 columns]

In [13]:
## drop all null from all columns
df_unclear2 = df_unclean.dropna()

In [14]:
df_unclear2.isnull().sum()

x_id        0
date_day    0
x_value     0
dtype: int64

In [15]:
df_unclear2.shape

(130179, 3)

In [16]:
130179/140000

0.92985

# Data Imputation

In [17]:
df_unclean

         x_id    date_day  x_value
0       134.0  2016-12-23     3.00
1       217.0  2017-02-20     2.00
2       173.0  2016-11-18     2.40
3        65.0  2016-04-21     3.00
4       102.0  2016-12-07     2.75
...       ...         ...      ...
139995   43.0  2016-10-17     3.00
139996  663.0  2016-10-07     2.00
139997  143.0  2015-06-07     1.00
139998  130.0  2016-07-18     3.00
139999  137.0  2016-06-17     2.00

[140000 rows x 3 columns]

In [18]:
# df_unclean['x_value'] = df_unclean['x_value'].fillna(df_unclean['x_id'])
df_unclean['x_value'] = df_unclean['x_value'].fillna(-1)

In [19]:
df_unclean.isnull().sum()

x_id        356
date_day    100
x_value       0
dtype: int64

In [24]:
df_unclean.sample(10)

         x_id    date_day   x_value
128015  121.0  2017-02-16  3.000000
83146   461.0  2016-03-31  3.000000
24772   308.0  2016-11-19  3.000000
79080   209.0  2016-06-28  3.000000
125862  162.0  2016-08-29  3.000000
58202   964.0  2017-03-10  1.000000
45665    98.0  2016-12-20  3.000000
135438   40.0  2016-12-22  2.500000
46525    16.0  2016-10-27 -1.000000
111300   34.0  2016-12-24  3.666667

# Forward and backwards filling of missing values

In [25]:
df_unclean = df_unclean0.copy()

In [26]:
df_unclean[df_unclean.x_value.isnull()].x_id.value_counts()

38.0     74
194.0    60
219.0    59
101.0    58
226.0    58
         ..
333.0     1
429.0     1
306.0     1
396.0     1
495.0     1
Name: x_id, Length: 505, dtype: int64

In [27]:
df_unclean_3 = df_unclean[(df_unclean['x_id'] == 59) & 
                          (~(df_unclean['date_day'].isnull()))]

In [30]:
df_unclean_3 = df_unclean_3.sort_values('date_day')
df_unclean_3.tail(10)

        x_id    date_day  x_value
57213   59.0  2017-03-09     2.25
91293   59.0  2017-03-10     2.25
9542    59.0  2017-03-11     2.50
91537   59.0  2017-03-12     4.00
60896   59.0  2017-03-13      NaN
7260    59.0  2017-03-15     2.00
122862  59.0  2017-03-16     3.00
28334   59.0  2017-03-16     3.00
49441   59.0  2017-03-18      NaN
105380  59.0  2017-03-18      NaN

In [31]:
df_unclean_3.isnull().sum()

x_id         0
date_day     0
x_value     24
dtype: int64

In [42]:
df_unclean_3['x_value'].fillna(method="ffill").tail(10)

57213     2.25
91293     2.25
9542      2.50
91537     4.00
60896     4.00
7260      2.00
122862    3.00
28334     3.00
49441     3.00
105380    3.00
Name: x_value, dtype: float64

In [34]:
df_unclean_3['x_value'].fillna(method="bfill").tail(10)

57213     2.25
91293     2.25
9542      2.50
91537     4.00
60896     2.00
7260      2.00
122862    3.00
28334     3.00
49441      NaN
105380     NaN
Name: x_value, dtype: float64

In [38]:
df_unclean_3['x_value'].fillna(method="ffill").mean()

3.3044932079414835

In [39]:
df_unclean_3['x_value_filled'] = df_unclean_3['x_value'].fillna(3.30449)

In [41]:
df_unclean_3.sample()

       x_id    date_day  x_value  x_value_filled
56039  59.0  2016-06-04      NaN         3.30449

## Duplicate

In [43]:
df_unclean

         x_id    date_day  x_value
0       134.0  2016-12-23     3.00
1       217.0  2017-02-20     2.00
2       173.0  2016-11-18     2.40
3        65.0  2016-04-21     3.00
4       102.0  2016-12-07     2.75
...       ...         ...      ...
139995   43.0  2016-10-17     3.00
139996  663.0  2016-10-07     2.00
139997  143.0  2015-06-07     1.00
139998  130.0  2016-07-18     3.00
139999  137.0  2016-06-17     2.00

[140000 rows x 3 columns]

In [45]:
df_unclean.drop_duplicates()

         x_id    date_day   x_value
0       134.0  2016-12-23  3.000000
1       217.0  2017-02-20  2.000000
2       173.0  2016-11-18  2.400000
3        65.0  2016-04-21  3.000000
4       102.0  2016-12-07  2.750000
...       ...         ...       ...
139982  190.0  2017-02-08  2.333333
139983  225.0  2016-09-18  3.500000
139991  827.0  2016-11-08  2.000000
139996  663.0  2016-10-07  2.000000
139997  143.0  2015-06-07  1.000000

[102178 rows x 3 columns]

In [47]:
df_unclean_unique = df_unclean.drop_duplicates()

In [49]:
## Notes : if the duplicates has different values, you can use GroupBy

## Outliers

simple outliers formula

In [50]:
df_unclean_unique.isnull().sum()

x_id         240
date_day      73
x_value     6848
dtype: int64

In [52]:
df_unclean_unique_null = df_unclean_unique[df_unclean_unique.x_value.isnull()]
df_unclean_unique_nonnull = df_unclean_unique[~(df_unclean_unique.x_value.isnull())]

In [53]:
Mx = df_unclean_unique_nonnull['x_value'].mean()
Sx = df_unclean_unique_nonnull['x_value'].std()

In [54]:
Mx-(2*Sx), Mx+(2*Sx)

(1.00757346810413, 4.643254477692857)

In [56]:
def is_outlier(x):
    if (x >= Mx-(2*Sx)) & (x <= Mx+(2*Sx)) :
        return False
    else:
        return True

In [57]:
df_unclean_unique_nonnull['x_value'].apply(is_outlier)

0         False
1         False
2         False
3         False
4         False
          ...
139982    False
139983    False
139991    False
139996    False
139997     True
Name: x_value, Length: 95330, dtype: bool

In [58]:
df_unclean_unique_nonnull['detect_outlier'] = df_unclean_unique_nonnull['x_value'].apply(is_outlier)

/Users/alamhanz/anaconda/envs/p37/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [69]:
df_unclean_unique_nonnull[df_unclean_unique_nonnull['detect_outlier'] == 1].shape

(10625, 4)

In [70]:
10625/df_unclean_unique_nonnull.shape[0]

0.11145494597713207

In [68]:
df_unclean_unique_nonnull[df_unclean_unique_nonnull['detect_outlier'] == 1].sample(10)

         x_id    date_day   x_value  detect_outlier
107488  215.0  2016-02-10  1.000000            True
89113   123.0  2015-09-23  1.000000            True
32178   208.0  2016-01-29  1.000000            True
83385   679.0  2017-01-26  1.000000            True
104411  115.0  2015-07-14  1.000000            True
135456  566.0  2017-03-15  5.297846            True
49645   212.0  2016-05-03  1.000000            True
135476   20.0  2016-08-05  1.000000            True
136887  468.0  2017-03-09  1.000000            True
12410   103.0  2015-05-20  1.000000            True

In [71]:
## Handling Outlier (one options)
max_acceptable_value = Mx+(2*Sx)
min_acceptable_value = Mx-(2*Sx)
min_acceptable_value,max_acceptable_value

(1.00757346810413, 4.643254477692857)

In [79]:
df_unclean_unique_nonnull['x_value_handle'] = np.where(df_unclean_unique_nonnull['x_value'] > max_acceptable_value, max_acceptable_value,
         np.where(df_unclean_unique_nonnull['x_value'] < min_acceptable_value, min_acceptable_value,
                 df_unclean_unique_nonnull['x_value']))

/Users/alamhanz/anaconda/envs/p37/lib/python3.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [80]:
# A = 15

In [81]:
# np.where(A>10,1,3)

In [94]:
df_unclean_unique_nonnull[df_unclean_unique_nonnull['detect_outlier'] == 1].sample(15)

         x_id    date_day  x_value  detect_outlier  x_value_handle
69508    92.0  2016-08-20  6.00445            True        4.643254
56998   215.0  2016-11-02  1.00000            True        1.007573
116528  255.0  2016-01-26  1.00000            True        1.007573
9741    191.0  2015-05-29  1.00000            True        1.007573
41398   208.0  2016-07-28  1.00000            True        1.007573
9670    293.0  2016-12-23  1.00000            True        1.007573
61429   139.0  2015-11-17  1.00000            True        1.007573
85146   681.0  2017-01-07  1.00000            True        1.007573
17049   553.0  2015-11-24  1.00000            True        1.007573
102893  461.0  2016-10-19  1.00000            True        1.007573
69448    52.0  2017-02-04 -0.19237            True        1.007573
60760     2.0  2015-10-14  1.00000            True        1.007573
66582   158.0  2016-07-01  1.00000            True        1.007573
56852   964.0  2017-01-25  1.00000            True        1.007573
10967   370.0  2016-09-02  1.00000            True        1.007573